In [273]:
import pandas as pd
import numpy as np

In [274]:
# Load the Excel file, but only load the specific sheet '2019_Patient_data'
file_path = '/Users/haritshah/Desktop/2024_PatentCrudePrevelance_11022024.xlsx'
sheet_name = '2022_Patient_Data'

In [275]:
# Load only the specific sheet
df = pd.read_excel(file_path, sheet_name=sheet_name)
df.head()

,Year,Id,Code,Date,Type,Type2,City,State,Country,Zip Code
0,2022,1,17567110,44562,Utility,SMALL,Spanish Fork,UT,US,84660
1,2022,2,17567111,44562,Utility,MICRO,Beer Yaakov,NaN,IS,7031442
2,2022,3,17567114,44562,Utility,SMALL,Rochester,NY,US,14612
3,2022,4,17567120,44562,Utility,SMALL,Erie,PA,US,16505
4,2022,5,17646721,44562,Utility,MICRO,Athens,OT,GR,11523

In [276]:
# Filter the dataframe to include only rows where 'Country' is 'US'
df_cleaned = df[df['Country'] == 'US']

# Reset the index of the cleaned dataframe and drop the old index
df_cleaned.reset_index(drop=True, inplace=True)

# Create a new 'Id' column with a range of values starting from 1 to the length of the cleaned dataframe
df_cleaned['Id'] = range(1, len(df_cleaned) + 1)

# Display the first few rows of the cleaned dataframe
df_cleaned.head()

/var/folders/7h/41kdp80x0s59g14w69dkvvbr0000gn/T/ipykernel_5254/972403615.py:8: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_cleaned['Id'] = range(1, len(df_cleaned) + 1)

,Year,Id,Code,Date,Type,Type2,City,State,Country,Zip Code
0,2022,1,17567110,44562,Utility,SMALL,Spanish Fork,UT,US,84660
1,2022,2,17567114,44562,Utility,SMALL,Rochester,NY,US,14612
2,2022,3,17567120,44562,Utility,SMALL,Erie,PA,US,16505
3,2022,4,17567113,44562,Utility,UNDISCOUNTED,McLean,VA,US,22102
4,2022,5,17567116,44562,Utility,SMALL,Fort Lauderdale,FL,US,33301

In [277]:
null_columns = df_cleaned[['Year', 'Id', 'Code', 'Date', 'Type', 'Type2', 'City', 'State', 'Country']].isnull().sum()
print(null_columns)

Year         0
Id           0
Code         0
Date         0
Type       346
Type2        0
City         1
State       21
Country      0
dtype: int64

In [278]:
unique_values_type = df_cleaned['Type'].unique()
count_unique_values_type = len(unique_values_type)

print(f"Unique values in 'Type': {unique_values_type}")
print(f"Count of unique values in 'Type': {count_unique_values_type}")
type_counts = df_cleaned['Type'].value_counts()
print(f"Count of each unique value in 'Type':\n{type_counts}")

Unique values in 'Type': ['Utility' 'Provisional' 'Design' 'PCT' nan 'Plant' 'Re-Issue'
 'Re-Examination']
Count of unique values in 'Type': 8
Count of each unique value in 'Type':
Type
Utility           373224
Provisional        36284
Design              9801
PCT                 6009
Plant                855
Re-Issue             748
Re-Examination       355
Name: count, dtype: int64

In [279]:
nan_type_rows = df_cleaned[df_cleaned['Type'].isna()].head(15)
print(nan_type_rows)

      Year    Id      Code   Date Type         Type2           City State  \
1124  2022  1125  63295985  44564  NaN         SMALL        Atlanta    GA
1257  2022  1258  63361232  44564  NaN         MICRO     Vero Beach    FL
2669  2022  2670  63361546  44565  NaN         MICRO    Huntingtown    MD
4020  2022  4021  63296687  44566  NaN         SMALL         Dublin    OH
4114  2022  4115  63361567  44566  NaN         SMALL      Bethlehem    PA
4123  2022  4124  63361555  44566  NaN         SMALL  Oklahoma City    OK
5584  2022  5585  63297039  44567  NaN         SMALL        Chicago    IL
5760  2022  5761  63361565  44567  NaN         SMALL       Chandler    AZ
7487  2022  7488  63297572  44568  NaN  UNDISCOUNTED      Lexington    MA
7555  2022  7556  63361573  44568  NaN  UNDISCOUNTED       Cranbury    NJ
7597  2022  7598  63297638  44568  NaN         SMALL      SAN DIEGO    CA
7663  2022  7664  63293655  44569  NaN         SMALL   Laguna Beach    CA
9436  2022  9437  63297917  44571  NaN         SMALL   Laguna Beach    CA
9443  2022  9444  63297920  44571  NaN         SMALL   Laguna Beach    CA
9516  2022  9517  63361603  44571  NaN         SMALL    East Haddam    CT

     Country    Zip Code
1124      US       30339
1257      US       32960
2669      US       20639
4020      US       43017
4114      US       18015
4123      US       73150
5584      US  60690-2786
5760      US       85226
7487      US        2420
7555      US        8512
7597      US  92121-2133
7663      US       92651
9436      US       92651
9443      US       92651
9516      US        6423

In [280]:
print(df_cleaned['Zip Code'].dtype) 

# Convert the 'Zip Code' column to a string
df_cleaned.iloc[:, df_cleaned.columns.get_loc('Zip Code')] = df_cleaned.iloc[:, df_cleaned.columns.get_loc('Zip Code')].astype(str)
print(df_cleaned['Zip Code'].dtype) 
print(df_cleaned['Zip Code'].head())

object
object
0    84660
1    14612
2    16505
3    22102
4    33301
Name: Zip Code, dtype: object

In [281]:
# Remove any leading or trailing whitespaces from the 'Zip Code' column
df_cleaned['Zip Code'] = df_cleaned['Zip Code'].str.strip()
#print(df_cleaned['Zip Code'].head())
print(df_cleaned[(df_cleaned['Zip Code'] == '30339') & (df_cleaned['Type2'] == 'UNDISCOUNTED')])

        Year      Id      Code   Date         Type         Type2     City  \
144     2022     145  17567261  44564      Utility  UNDISCOUNTED  Atlanta
165     2022     166  17567281  44564      Utility  UNDISCOUNTED  Atlanta
195     2022     196  17567302  44564      Utility  UNDISCOUNTED  Atlanta
223     2022     224  17567321  44564      Utility  UNDISCOUNTED  Atlanta
234     2022     235  17567360  44564      Utility  UNDISCOUNTED  Atlanta
...      ...     ...       ...    ...          ...           ...      ...
425821  2022  425822  18147732  44924      Utility  UNDISCOUNTED  Atlanta
425880  2022  425881  18147986  44924      Utility  UNDISCOUNTED  Atlanta
426975  2022  426976  18091986  44925      Utility  UNDISCOUNTED  Atlanta
427139  2022  427140  18148539  44925      Utility  UNDISCOUNTED  Atlanta
427531  2022  427532  63477871  44925  Provisional  UNDISCOUNTED  Atlanta

       State Country Zip Code
144       GA      US    30339
165       GA      US    30339
195       GA      US    30339
223       GA      US    30339
234       GA      US    30339
...      ...     ...      ...
425821    GA      US    30339
425880    GA      US    30339
426975    GA      US    30339
427139    GA      US    30339
427531    GA      US    30339

[1845 rows x 10 columns]

/var/folders/7h/41kdp80x0s59g14w69dkvvbr0000gn/T/ipykernel_5254/3864174683.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_cleaned['Zip Code'] = df_cleaned['Zip Code'].str.strip()

In [282]:
df_cleaned.loc[(df_cleaned['Zip Code'] == '30339') & (df_cleaned['Type'].isnull()), 'Type'] = 'Utility'
#print(df_cleaned[(df_cleaned['Zip Code'] == '30339') & (df_cleaned['Type2'] == 'UNDISCOUNTED')])

# Create a hashmap (dictionary) with unique Zip Code and Type pairs
zip_type_map = df_cleaned.dropna(subset=['Type']).set_index('Zip Code')['Type'].to_dict()

# Fill null values in 'Type' column using the hashmap
df_cleaned['Type'] = df_cleaned.apply(
    lambda row: zip_type_map.get(row['Zip Code'], row['Type']) if pd.isnull(row['Type']) else row['Type'],
    axis=1
)

# Print the rows where 'Zip Code' is '30339' and 'Type2' is 'UNDISCOUNTED'
#print(df_cleaned[(df_cleaned['Zip Code'] == '30339') & (df_cleaned['Type2'] == 'UNDISCOUNTED')])

/var/folders/7h/41kdp80x0s59g14w69dkvvbr0000gn/T/ipykernel_5254/2092395816.py:8: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_cleaned['Type'] = df_cleaned.apply(

In [283]:
null_columns = df_cleaned[['Year', 'Id', 'Code', 'Date', 'Type', 'Type2', 'City', 'State', 'Country']].isnull().sum()
print(null_columns)
#print(df_cleaned[df_cleaned['Type'].isnull()])

Year        0
Id          0
Code        0
Date        0
Type       31
Type2       0
City        1
State      21
Country     0
dtype: int64

In [284]:
rows_before = len(df_cleaned)
df_cleaned.dropna(inplace=True)
rows_after = len(df_cleaned)
rows_removed = rows_before - rows_after
print(f"Number of rows removed: {rows_removed}")
df_cleaned.reset_index(drop=True, inplace=True)
null_sum = df_cleaned.isnull().sum().sum()
print(f"Total number of null values in the dataframe: {null_sum}")

Number of rows removed: 52
Total number of null values in the dataframe: 0

/var/folders/7h/41kdp80x0s59g14w69dkvvbr0000gn/T/ipykernel_5254/3477448243.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_cleaned.dropna(inplace=True)

In [285]:
unique_values_type2 = df_cleaned['Type2'].unique()
print(f"Unique values in 'Type2': {unique_values_type2}")
total_blank_type2 = df_cleaned[df_cleaned['Type2'] == ' '].shape[0]
print(f"Total number of rows with ' ' in 'Type2' column: {total_blank_type2}")
 
 
blank_type2_row = df_cleaned[df_cleaned['Type2'] == ' ']
print(blank_type2_row)

Unique values in 'Type2': ['SMALL' 'UNDISCOUNTED' 'MICRO']
Total number of rows with ' ' in 'Type2' column: 0
Empty DataFrame
Columns: [Year, Id, Code, Date, Type, Type2, City, State, Country, Zip Code]
Index: []

In [286]:
# Remove rows where 'Type2' column has a value of ' '
df_cleaned = df_cleaned[df_cleaned['Type2'] != ' ']

# Reset the index of the cleaned dataframe and drop the old index
df_cleaned.reset_index(drop=True, inplace=True)

In [287]:
unique_values_type2 = df_cleaned['Type2'].unique()
print(f"Unique values in 'Type2': {unique_values_type2}")

Unique values in 'Type2': ['SMALL' 'UNDISCOUNTED' 'MICRO']

In [288]:
# Create a copy of original data
df_cleaned['Original_Zip'] = df_cleaned['Zip Code']

# Clean zip codes
def clean_zip(zip_code):
    # Convert to string
    zip_str = str(zip_code)
    # Remove non-numeric characters
    numeric_only = ''.join(filter(str.isdigit, zip_str))
    
    # Check if length is 4 or 5
    if len(numeric_only) == 5:
        return numeric_only
    elif len(numeric_only) == 4:
        return numeric_only
    else:
        return None

# Apply cleaning
df_cleaned['Zip Code'] = df_cleaned['Zip Code'].apply(clean_zip)

# Remove rows with invalid zip codes if needed
df_cleaned = df_cleaned.dropna(subset=['Zip Code'])

# Verify results
print("Sample of cleaned zip codes:")
print(df_cleaned[['Original_Zip', 'Zip Code']].head(10))
print("\nNumber of valid zip codes:", df_cleaned['Zip Code'].notna().sum())
# Print the number of null values in the 'Zip Code' column
num_null_zip_codes = df_cleaned['Zip Code'].isnull().sum()
print(f"Number of null values in 'Zip Code' column: {num_null_zip_codes}")

Sample of cleaned zip codes:
  Original_Zip Zip Code
0        84660    84660
1        14612    14612
2        16505    16505
3        22102    22102
4        33301    33301
5        94705    94705
6        19008    19008
7        34756    34756
8        12203    12203
9        89511    89511

Number of valid zip codes: 330126
Number of null values in 'Zip Code' column: 0

In [289]:
df_cleaned.reset_index(drop=True, inplace=True)
# Create a new 'Id' column with a range of values starting from 1 to the length of the cleaned dataframe
df_cleaned['Id'] = range(1, len(df_cleaned) + 1)
df_cleaned.head()

,Year,Id,Code,Date,Type,Type2,City,State,Country,Zip Code,Original_Zip
0,2022,1,17567110,44562,Utility,SMALL,Spanish Fork,UT,US,84660,84660
1,2022,2,17567114,44562,Utility,SMALL,Rochester,NY,US,14612,14612
2,2022,3,17567120,44562,Utility,SMALL,Erie,PA,US,16505,16505
3,2022,4,17567113,44562,Utility,UNDISCOUNTED,McLean,VA,US,22102,22102
4,2022,5,17567116,44562,Utility,SMALL,Fort Lauderdale,FL,US,33301,33301

In [290]:
output_file_path = '/Users/haritshah/Desktop/Edited_Patient_Data2022.xlsx'
df_cleaned.to_excel(output_file_path, index=False)